[
    {
        "name": "Politecnico di Torino",
        "link": "https://www.polito.it/",
        "img": "poli.svg",
        "theme": "dark",
        "texts": [
            "Politecnico di Torino (Polytechnic University of Turin) is the oldest public technical university of Italy, located in Turin. Consistently ranked as one of the best universities in Italy and in Europe, as of 2022 PoliTo is ranked by QS World University Rankings 33rd among the engineering and technology universities in the world.",
            "Politecnico's Department of Mechanical and Aerospace Engineering (DIMEAS) is the main financial partner of the Team."
        ]
    },
    {
        "name": "Mul2 Research Group",
        "img": "mul2_ter.png",
        "link": "http://www.mul2.polito.it/",
        "theme": null,
        "texts": [
            "Mul2 Research Group is a research project within Politecnico di Torino's Dept. of Mechanical and Aerospace Engineering, devoted to the development of advanced structural models for MULSs with particular attention given to the multifield analysis and the fluid-structure interactions.",
            "Mul2 provides material support, with 3D printers and 3D printing materials, along with technical support for the additive manufacturing processes."
        ]
    },
    {
        "name": "BETA CAE Systems",
        "link": "https://www.beta-cae.com/",
        "img": "BETA_CAE_Systems.svg",
        "theme": "light",
        "texts": [
            "BETA CAE Systems transformed CAE by introducing revolutionary automation software tools and practices into Simulation and Analysis processes almost 30 years ago. Today, BETA CAE Systems is a world leader of Engineering Simulation, thanks to their softwares deployed in the Aerospace, Defense, Automotive, Biomechanics, Electronics, Energy and other Industries.",
            "BETA CAE Systems provides material support with the ANSA and META software suites, as well as technical support to the Team."
        ]
    },
    {
        "name": "ASSOCAM Scuola Camerana",
        "link": "https://www.scuolacamerana.it/",
        "img": "Camerana.png",
        "theme": "light",
        "texts": [
            "ASSOCAM Scuola Camerana, is a Turin-based organisation rooted in the city's industrial fabric that has been providing post-diploma training since 1959. It brings together experienced technicians and teachers, as well as a large number of laboratories and machinery for students. In particular, it is a training agency of Unione Industriali and Camera di Commercio of Turin with a focus on technological training applied to industrial processes.",
            "Assocam Scuola Camerana provides the team with the necessary mechanical machining and components for its activities."
        ]
    },
    {
        "name": "The Exploration Company",
        "link": "https://www.exploration.space/",
        "img": "ExplorationCompany.png",
        "theme": "dark",
        "texts": [
            "The Exploration Company is a space engineering firm based in Wessling, Germany. Their efforts are concentrated in the developement of Nyx, a modular, reusable and in-orbit refuelable space vehicle. It is set to have its earth orbit demo flight in 2024, and its first lunar mission is expected to take place in 2028. Their services will be available to serve a wide range of industries.",
            "The Exploration Company is in a technical partnership with PRT's Project Efesto, involved in the research and development of our first liquid rocket engine."
        ]
    },
    {
        "name": "BLU Electronic",
        "link": "http://www.bluelectronic.com/",
        "img": "BLU_Electronic.jpg",
        "theme": null,
        "texts": [
            "With over two decades of experience, Blu Electronic is a leading provider of electronic boards and equipment for the space and avionics industries.",
            "Blu Electronic's Aero activities commenced in 2007, and in 2009, the company achieved the UNI EN9100 certification, which it still maintains today. In 2010, it became part of Lombardia Aerospace and continues to provide cutting-edge solutions for space, avionics, and aerospace systems.",
            "Blue Electronic will provide our team with technical and material support."
        ]
    },
    {
        "name": "TekRevolution",
        "link": "https://www.tekrevolution.it/",
        "img": "Tek.svg",
        "theme": "dark",
        "texts": [
            "TekRevolution is an esteemed Italian engineering company, renowned for their meticulous understanding of technical needs and delivery of exceptional results. The company operates in different industrial sectors, thanks to its multidisciplinary team of highly qualified experts. They have extensive experience in technology integration and project management.",
            "TekRevolution provides technical support to the Team. The company lends their expertise and training to ensure the success of our groundbreaking projects."
        ]
    }
]
