[
    {
        "name": "Politecnico di Torino",
        "link": "https://www.polito.it/",
        "img": "poli.svg",
        "localTheme": "dark",
        "texts": [
            "Politecnico di Torino (Polytechnic University of Turin) is the oldest public technical university of Italy, located in Turin. Consistently ranked as one of the best universities in Italy and in Europe, as of 2022 PoliTo is ranked by QS World University Rankings 33rd among the engineering and technology universities in the world.",
            "Politecnico's Department of Mechanical and Aerospace Engineering (DIMEAS) is the main financial partner of the Team."
        ]
    },
    {
        "name": "Mul2 Research Group",
        "img": "mul2_ter.png",
        "link": "http://www.mul2.polito.it/",
        "localTheme": null,
        "texts": [
            "Mul2 Research Group is a research project within Politecnico di Torino's Dept. of Mechanical and Aerospace Engineering, devoted to the development of advanced structural models for MULSs with particular attention given to the multifield analysis and the fluid-structure interactions.",
            "Mul2 provides material support, with 3D printers and 3D printing materials, along with technical support for the additive manufacturing processes."
        ]
    },
    {
        "name": "Sòphia High Tech",
        "img": ["Logo_SHT_scontornatoDARK.png", "logo_sophia_biancoLIGHT.png"],
        "link": "https://www.sophiahightech.com/",
        "localTheme": null,
        "texts": [
            "Sòphia High Tech, certified according to the Quality Standard AS/EN9100, operates in the Aerospace field, focusing on the design, development and production of metal alloy components using Additive Manufacturing and CNC Machining. Sòphia uses the most advanced technological processes: to produce complex components in shape and geometry, Sòphia uses Additive Manufacturing (SLM), according to ECSS-Q-ST-70-80C.",
            "Sophia High Tech supports the team in the development of project Efesto by providing state-of-the-art equipment, which will be crucial for the success of the project."
        ]
    },
    {
        "name": "BETA CAE Systems",
        "link": "https://www.beta-cae.com/",
        "img": "BETA_CAE_Systems.svg",
        "localTheme": "light",
        "texts": [
            "BETA CAE Systems transformed CAE by introducing revolutionary automation software tools and practices into Simulation and Analysis processes almost 30 years ago. Today, BETA CAE Systems is a world leader of Engineering Simulation, thanks to their softwares deployed in the Aerospace, Defense, Automotive, Biomechanics, Electronics, Energy and other Industries.",
            "BETA CAE Systems provides material support with the ANSA and META software suites, as well as technical support to the Team."
        ]
    },
    {
        "name": "ASSOCAM Scuola Camerana",
        "link": "https://www.scuolacamerana.it/",
        "img": "Camerana.png",
        "localTheme": "light",
        "texts": [
            "ASSOCAM Scuola Camerana, is a Turin-based organisation rooted in the city's industrial fabric that has been providing post-diploma training since 1959. It brings together experienced technicians and teachers, as well as a large number of laboratories and machinery for students. In particular, it is a training agency of Unione Industriali and Camera di Commercio of Turin with a focus on technological training applied to industrial processes.",
            "Assocam Scuola Camerana provides the team with the necessary mechanical machining and components for its activities."
        ]
    },
    {
        "name": "TekRevolution",
        "link": "https://www.tekrevolution.it/",
        "img": "Tek.svg",
        "localTheme": "dark",
        "texts": [
            "TekRevolution is an esteemed Italian engineering company, renowned for their meticulous understanding of technical needs and delivery of exceptional results. The company operates in different industrial sectors, thanks to its multidisciplinary team of highly qualified experts. They have extensive experience in technology integration and project management.",
            "TekRevolution provides technical support to the Team. The company lends their expertise and training to ensure the success of our groundbreaking projects."
        ]
    },
    {
        "name": "Explorer Cases",
        "link": "https://www.explorercases.com/",
        "img": "explorer-cases.webp",
        "localTheme": null,
        "texts": [
            "EXPLORER CASES is a range of indestructible and waterproof cases which guarantee maximum protection when transporting professional equipment manufactured by GT line. It is a leading brand in the sector, established internationally.",
            "Constant investment in R&D has allowed them to develop efficient solutions, for which they have obtained multiple certifications. The cases are subjected to strict laboratory tests to guarantee their reliability to extreme conditions of use.",
            "Explorer cases supports the team by providing its cases for the safe and practical transport of our equipment."
        ]
    },
    {
        "name": "Ansys",
        "link": "https://www.ansys.com/",
        "img": "Ansys.png",
        "localTheme": "dark",
        "texts": [
            "With more than 50 years of experience, Ansys is the world reference in engineering simulation. Its solutions are used by market leaders in all industries to revolutionize design, enabling engineers to explore and predict how products will perform in the real world.",
            "Reducing prototype costs and production time, improving quality, reducing risk, accelerating innovation across all industries to push the boundaries the predictive power of Ansys simulation is at your fingertips."
        ]
    },
    {
        "name": "ESSS",
        "link": "https://www.esss.com/",
        "img": "Esss.png",
        "localTheme": null,
        "texts": [
            "ESSS is a leading engineering solutions and scientific software company specializing in advanced simulations for industries such as aerospace, automotive, and energy.",
            "It offers tools for finite element analysis, computational fluid dynamics and multiphysics simulations, enabling companies to optimize design processes, reduce costs and improve efficiency.",
            "With dedicated consulting and training, ESSS supports innovation and helps customers achieve new standards of competitiveness."
        ]
    },
    
    {
        "name": "JEToP",
        "img": "JEToP.png",
        "localTheme": "dark",
        "link": "https://www.jetop.com/",
        "texts": null
    }
]
